["She lives on Rue du Rhône, near the center.",
"We took the tram to Plainpalais this morning.",
"Our clinic is located in Chêne-Bourg.",
"He commutes from Bulle every day.",
"The meeting took place in Eaux-Vives.",
"They moved to a flat in Jonction.",
"His house is on Maple Avenue.",
"I’ll meet you in front of the café on Rue Voltaire.",
"She was raised in Martigny but now lives in Zurich.",
"Their offices are in Le Flon.",
"He’s registered at Rue de Lausanne 42.",
"Our studio is in the Seefeld district.",
"They just bought a place in Nyon.",
"The appointment is at 6 Rue du Lac.",
"They live in a quiet part of Vevey.",
"The shop is near Bahnhofstrasse in Zurich.",
"We walked through the old town of Bern.",
"My grandmother lives in Petit-Saconnex.",
"He’s from a small village near Sion.",
"Their headquarters are on Avenue de France.",
"She studies at the university in Neuchâtel.",
"He lives in Carouge, right by the roundabout.",
"Our Airbnb was near Rue Dufour.",
"The hospital is in Plan-les-Ouates.",
"He lives in the Pâquis neighborhood.",
"The documents were sent from Rue des Alpes.",
"She has an apartment in Clarens.",
"We stayed at a hotel on Boulevard Helvétique.",
"The lab is located on Route de Florissant.",
"They opened a new branch in Breite.",
"We had a picnic near Lake Geneva.",
"He walked from Rue Centrale to the station.",
"I found parking in Rue du Marché.",
"The seminar was held in Fribourg downtown.",
"They live in a small alley near Oak Lane.",
"She recently moved to Rue Dufour in Geneva.",
"He lives near Greenwood Avenue, just past the bakery.",
"Their office is in Brick Lane, above the gallery.",
"We walked around Shibuya after dinner.",
"She rents a studio in Bairro Alto.",
"The school is close to Miraflores park.",
"He grew up in Harlem, knows every corner.",
"The launch party was held in Makati.",
"She took a flat in Camden Town last month.",
"We’re based in the South Bronx branch.",
"Their apartment overlooks Sukhumvit road.",
"He used to work in the Mission District.",
"The studio is located in Bukit Bintang.",
"She arrived from Old Dhaka yesterday.",
"I stayed in a guesthouse in Kabukicho.",
"They own a condo in Newtown, Sydney.",
"Our contact works in Koreatown, LA.",
"You can find him at a shop in Causeway Bay.",
"The event was held in Itaewon, Seoul.",
"They live in a quiet part of Raval.",
"She grew up near Vauxhall.",
"He has a bookstore in Bairro da Liberdade.",
"We met in Le Plateau for brunch.",
"Their address is near Lavapiés metro.",
"The school is across the street in Surco.",
"He’s doing fieldwork in El Born district.",
"The family lives in Gangnam.",
"I got lost around Karama last time.",
"She works in a café in Chinatown.",
"The startup office is in Wicker Park.",
"She just rented a studio in Flatbush.",
"The hotel was in Banani, Dhaka.",
"We spent the weekend in Poblacion.",
"Their lab is in Kreuzberg, Berlin."]